In [1]:
import pandas as pd
from pathlib import Path

In [2]:
readpath = Path.cwd() / 'salaryData.csv'
df_salary = pd.read_csv(readpath)
df_salary.drop(['Rk'],axis=1,inplace=True)
df_salary.head()

            Player  Pos   Tm         City   Cap Hit  year
0       Drew Brees  NaN  NOR  New Orleans  26400000  2015
1    Philip Rivers  NaN  SDG    San Diego  21166668  2015
2   Calvin Johnson  NaN  DET      Detroit  20558000  2015
3  Charles Johnson  NaN  CAR     Carolina  20020000  2015
4        Matt Ryan  NaN  ATL      Atlanta  19500000  2015

In [3]:
readpath = Path.cwd() / 'playerData.csv'
df_player = pd.read_csv(readpath)
df_player.head()

,Rank,Player,Tm,FantPos,Age,Games,Games Started,Passing Completions,Passing Attempts,Passing Yards,...,Fantasy Points,Fantasy PPR,Fantasy DKPt,Fantasy FDPt,Fantasy VBD,Fantasy Position Rank,Fantasy Overall Rank,year,Unnamed: 32,Unnamed: 33
0,1,Antonio Brown *+,PIT,WR,27,16,16,0,0,0,...,252,388.2,393.2,320.2,125,1,1,2015,NaN,NaN
1,2,Devonta Freeman *,ATL,RB,23,15,13,0,0,0,...,243,316.4,324.4,279.9,123,1,2,2015,NaN,NaN
2,3,Julio Jones *+,ATL,WR,26,16,16,0,0,0,...,239,375.1,379.1,307.1,111,2,3,2015,NaN,NaN
3,4,Adrian Peterson*+,MIN,RB,30,16,16,0,0,0,...,231,260.7,269.7,245.7,110,2,4,2015,NaN,NaN
4,5,Cam Newton*+,CAR,QB,26,16,16,296,495,3837,...,389,389.1,409.1,399.1,105,1,5,2015,NaN,NaN

In [4]:
df_player_trimmed = df_player[['Player', 'FantPos', 'Age']]
df_player_trimmed['Player'] = df_player_trimmed['Player'].str.replace(r'\*', '')
df_player_trimmed['Player'] = df_player_trimmed['Player'].str.replace(r'\+', '')
df_player_trimmed.head(100)

<ipython-input-4-129bff3f955f>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_player_trimmed['Player'] = df_player_trimmed['Player'].str.replace(r'\*', '')
<ipython-input-4-129bff3f955f>:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_player_trimmed['Player'] = df_player_trimmed['Player'].str.replace(r'\+', '')

              Player FantPos Age
0     Antonio Brown       WR  27
1   Devonta Freeman       RB  23
2       Julio Jones       WR  26
3    Adrian Peterson      RB  30
4         Cam Newton      QB  26
..               ...     ...  ..
95       Josh McCown      QB  36
96       Andrew Luck      QB  26
97    Blaine Gabbert      QB  26
98       Kamar Aiken      WR  26
99     Michael Floyd      WR  26

[100 rows x 3 columns]

## Creating players DataFrame

In [5]:
df_salary.head()

            Player  Pos   Tm         City   Cap Hit  year
0       Drew Brees  NaN  NOR  New Orleans  26400000  2015
1    Philip Rivers  NaN  SDG    San Diego  21166668  2015
2   Calvin Johnson  NaN  DET      Detroit  20558000  2015
3  Charles Johnson  NaN  CAR     Carolina  20020000  2015
4        Matt Ryan  NaN  ATL      Atlanta  19500000  2015

In [6]:
df_salary.sort_values('Player').drop_duplicates(subset=['Player','Tm'],keep='last', inplace=True)
df_salary.insert(0,'playerID',range(10000,10000 + len(df_salary)))

In [7]:
df_salary.head()

   playerID           Player  Pos   Tm         City   Cap Hit  year
0     10000       Drew Brees  NaN  NOR  New Orleans  26400000  2015
1     10001    Philip Rivers  NaN  SDG    San Diego  21166668  2015
2     10002   Calvin Johnson  NaN  DET      Detroit  20558000  2015
3     10003  Charles Johnson  NaN  CAR     Carolina  20020000  2015
4     10004        Matt Ryan  NaN  ATL      Atlanta  19500000  2015

In [8]:
df_salary.groupby('Player').count()

                  playerID  Pos  Tm  City  Cap Hit  year
Player
A'Shawn Robinson         5    5   5     5        5     5
A.J. Bouye               6    5   6     6        6     6
A.J. Brown               2    2   2     2        2     2
A.J. Cann                6    5   6     6        6     6
A.J. Derby               3    3   3     1        3     3
...                    ...  ...  ..   ...      ...   ...
Zane Beadles             4    3   4     4        4     4
Zane Gonzalez            4    4   4     3        4     4
Zaviar Gooden            1    1   1     0        1     1
Zay Jones                4    4   4     3        4     4
Zeke Turner              2    2   2     2        2     2

[3947 rows x 6 columns]

In [ ]:
df_salary = df_salary.astype({'Cap Hit': 'object', 'year': 'object'})

In [ ]:
player1 = df_salary['Player']
player2 = df_player_trimmed['Player']
player = pd.concat([player1,player2])
player = pd.DataFrame(player)
player.drop_duplicates(inplace=True)

In [ ]:
playerpos1 = df_salary[['Player','Pos']]
playerpos2 = df_player_trimmed[['Player', 'FantPos']]
playerpos2.columns=['Player','Pos']

In [ ]:
players = pd.merge(player,playerpos1, how='left', on='Player')
players.describe()

In [ ]:
players = pd.merge(players, playerpos2, how='left', on='Player')
writepath = Path.cwd() / 'players.csv'
players.to_csv(writepath, index=False, header=True)
players.head(100)

In [ ]:
rosters = df_salary.copy()
rosters = rosters.drop(['Pos','City'], axis=1)
cols = list(rosters.columns.values)
rosters = rosters[['Tm','Player','year','Cap Hit']]
writepath = Path.cwd() / 'rosters.csv'
rosters.to_csv(writepath, index=False, header=True)
rosters.head()